"""Turtle. Черепашья графика"""
import turtle
turtle.shape("turtle")
turtle.right(90)
turtle.forward(100)
turtle.left(90)
turtle.backward(100)
turtle.fd(100)
turtle.exitonclick()
# Turtle - принцип организации библиотеки графического вывода, построенный на метафоре Черепахи,
# воображаемого роботоподобного устройства, которое перемещается по экрану или бумаге и поворачивается
# в заданных направлениях, при этом оставляя (или, по выбору, не оставляя) за собой нарисованный след заданного цвета и ширины.